{
  "ragnar": {
    "id": "ragnar",
    "title": "Ragnar",
    "subtitle": "Played by Travis Fimmel",
    "role": "main",
    "heroInfo":
      "Ragnar Lothbrok is a restless warrior and family man who longs to find and explore new countries across the sea. His goal is to settle his own people to thrive on rich new farm lands. Now that he is King, his ambition to raid new kingdoms remains unquenchable, not least because he claims to be an ancestor of the Norse god Odin–the god of slain warriors, but also the god of eternal curiosity.",
    "actorName": "Travis Fimmel",
    "actorInfo":
      "On the big screen, Fimmel was most recently seen in lead role in “WARCRAFT” for Legendary Pictures/Universal which amassed more than $450 million worldwide. The film also stars Ben Foster, Dominic Cooper and Paula Patton and was directed by Duncan Jones. He was also seen in the romantic comedy “Maggie’s Plan” starring alongside Julianne Moore, Ethan Hawke and Greta Gerwig. The Rebecca Miller directed film premiered at the Toronto International Film Festival and was acquired by Sony Pictures Classics.\r\nUpcoming releases include a supporting role in the A24 film “Lean On Pete” opposite Chloe Sevigny, Steve Buscemi and Charlie Plummer and a lead role in the Paul Haggis co-scripted “Inversion,” as well as the Mark Steven Johnson indie “Finding Steve McQueen” with Forest Whitaker, Kate Bosworth and William Fichtner.\r\nPast credits include a supporting role opposite Matthew McConaughey as Johnny Doran in the Anchor Bay Entertainment film “Surfer, Dude”, a comedy about a surfer experiencing an existential crisis for director S.R. Blinder. Additional independent film credits include Ivory Trade, Needle and Restraint opposite Teresa Palmer and Stephen Moyer, The Experiment with Adrien Brody and Forest Whitaker, The Baytown Outlaws with Billy Bob Thornton, and Harodim, opposite Peter Fonda. In 2008, he starred opposite the late Patrick Swayze on A&E’s drama series “The Beast.”\r\nFimmel is a native of Echuca Victoria, Australia.",
    "poster":
      "http://mythologian.net/wp-content/uploads/2017/02/ragnar-lothbrok-real-vikings-1024x629.jpg",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_ragnar_16_9.jpg?w=548",
    "alt": "Travis Fimmel as Ragnar, Vikings"
  },
  "lagertha": {
    "id": "lagertha",
    "title": "Lagertha",
    "subtitle": "Played by Katheryn Winnick",
    "role": "main",
    "heroInfo":
      "Lagertha is the first wife of Ragnar Lothbrok. She is an Earl, a strong shield-maiden and a force to be reckoned with. She has always fought in the shield-wall alongside the men. Although fate has pulled her apart from Ragnar, it seems that the gods must have a plan to bring them back together, where they belong.",
    "actorName": "Katheryn Winnick",
    "actorInfo":
      "Entertainment Weekly declared that her role as “Lagertha” may be the “most exciting feminist character on TV.” Her portrayal of the fierce shield maiden has garnered her several impressive nominations including a nomination for a Critic’s Choice Award for Best Supporting Actress in a Drama Series, a Canadian Screen Award nomination for Best Performance by a Lead Dramatic Actress (2014), Best Actress in a Drama Series by the Women’s Image Network in both 2014 & 2015 and a Golden Maple Award nomination for Best Actress in a TV Series. In addition to these prestigious nominations, Katheryn won the Serendipity Film’s Award of Excellence at the Banff World Media Festival in 2015.Recently, Winnick wrapped production on the highly anticipated adaptation of the Stephen King novel The Dark Tower, starring Academy Award winner Matthew McConaughey and Golden Globe winner Idris Elba due for release in February 2017. Winnick also stars opposite Gerard Butler’s character in the Warner Brother’s feature film Geostorm, scheduled for release early next year. Winnick’s other credits include roles in such movies as Love and Other Drugs with Jake Gyllenhall, Killers starring Ashton Kutcher, as well as Stand up Guys with Al Pacino, Christopher Walken and Alan Arkin. She also starred in the Paul Giamatti comedy drama Cold Souls, which received a best ensemble performance nomination in the 2009 Gotham Independent Film Awards.Off the big screen, Katheryn is no stranger to TV and in addition to “Vikings” has had numerous television appearances including roles in “Person of Interest,” “House,” “CSI,” “Law and Order” and a notable recurring role on the hit primetime series, “Bones.”In 2015, Winnick was named as the brand ambassador for luxury Swiss watch company Raymond Weil and is currently the face of their 2016 elegant and feminine SHINE Collection. Katheryn proudly endorses the brand of watches, which celebrates both the strength and beauty of the active modern woman worldwide. In addition to acting, Katheryn Winnick is an accomplished martial artist who holds a third-degree black belt in Taekwondo and a second-degree black belt in Karate. By 21, she had founded and owned three martial arts schools. After completing her university education at York University, Toronto, Katheryn went on to successfully pursue an acting career in New York and subsequently Los Angeles.",
    "poster":
      "http://www.theirishworld.com/wp-content/uploads/2014/02/v2_lagertha_09132013_jh_00802-e1392745890654.jpg",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_lagertha.jpg?w=548",
    "alt": "Katheryn Winnick as Lagertha, Vikings"
  },
  "aethelwulf": {
    "id": "aethelwulf",
    "title": "Aethelwulf",
    "subtitle": "Played by Moe Dunford",
    "role": "secondary",
    "heroInfo":
      "Son of King Ecbert, Aethelwulf doesn’t understand his father’s interest in Ragnar and the pagan Northmen, but as a faithful son he will do whatever his father asks. Ecbert is grooming him to become king and continue his lineage.",
    "actorName": "Moe Dunford",
    "actorInfo":
      "Moe recently wrapped on John Butler’s next film Handsome Devil playing the role of Pascal opposite Andrew Scott. Moe is one of ten European actors to receive a Shooting Star award in Berlin as part of the Berlin International Film Festival 2015.Moe was awarded the IFTA 2015 for Best Lead Actor, Film for his role as Patrick in Patrick’s Day directed by Terry McMahon which first premiered at the prestigious SXSW Festival in Austin, Texas in March 2014. Moe was nominated for the prestigious Bingham Ray New Talent Award at the Galway Film Fleadh 2014 for his work on this movie which won the Best Feature Award at the same festival. Moe also won the award for best actor at the Hell’s Half Mile Film Festival in Michigan amongst several other international awards and nominations.Patrick’s Day has gone on to receive both critical and audience acclaim at festivals across Europe and North America and was chosen as the Irish entry for the Directors Guild Finders Series Award and has been screened in LA as part of this prestigious selection. Patrick’s Day won the “Maverick” Grand Jury Prize winner of the 15th Woodstock Film Festival for best film.Moe also recently appeared in the indie feature film “Traders” for Coco Television directed by Peter Murphy and Rachel Moriarty. Other screen work includes “Raw” Series 5 in the recurring role Niall for Octagon/RTE, the recurring role of Christian in “An Criss Eile” directed by Charlie McCarthy for Wildfire Films/TG4. Moe also appeared as Richard Leland in two episodes of Season 4 of “The Tudors” for Showtime/BBC. ",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_aethelwulf.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_aethelwulf.jpg?w=548",
    "alt": "Moe Dunford as Aethelwulf, Vikings"
  },
  "astrid": {
    "id": "astrid",
    "title": "Astrid",
    "subtitle": "Played by Josefin Asplund",
    "role": "secondary",
    "heroInfo":
      "Astrid is a beautiful young woman who has joined Lagertha’s court at Hedeby. She is a free spirit who refuses to accept social conventions or recognize any barriers to her freedom: she is on a voyage of self-discovery. Lagertha will train Astrid in the arts of war, and the arts of love.",
    "actorName": "Josefin Asplund",
    "actorInfo":
      "Josefin Asplund is a Swedish-born actress that graduated from the Dramatic Arts Program in Södra Latins Gymnasium in Stockholm, in 2010. Shortly after, she landed her first international role playing opposite Daniel Craig, as his daughter, in The Girl With The Dragon Tattoo, directed by David Fincher. The year after she went on to play one of the leads in Call Girl, an award winning Swedish drama directed by Mikael Marcimain. In 2015, Josefin played one of the leads in The Circle, a fantasy drama directed and co-written by Levan Akin, based on the Swedish best-selling novel by the same name. During fall of 2016, Josefin will be seen as “Blanche” in a new TV series called Seven Dwarfs and Me, a French & Belgian co-production, directed by Luc Chalifour. Josefin has been nominated for the Rising Star Award at Stockholm Film Festival both in 2012 and 2015.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_astrid.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_astrid.jpg?w=548",
    "alt": "Josefin Asplund as Astrid , Vikings"
  },
  "bjorn": {
    "id": "bjorn",
    "title": "Bjorn",
    "subtitle": "Played by Alexander Ludwig",
    "role": "main",
    "heroInfo":
      "Bjorn Lothbrok is the son of Ragnar and Lagertha and the oldest of Ragnar’s many sons. Intelligent and determined, Bjorn loves and admires his father above all men. Following in Ragnar’s footsteps, Bjorn desires to test himself as a fighter as well as an explorer. After fighting in battle without receiving one wound or scratch, he garnered the famous nickname “Bjorn Ironside.”",
    "actorName": "Alexander Ludwig",
    "actorInfo":
      "Alexander was recently seen in the thriller, Go With Me, opposite Julia Stiles and Anthony Hopkins; Final Girl, opposite Abigail Breslin and Wes Bentley and The Final Girls in which he stars opposite Malin Akerman and Nina Dobrev.Ludwig grew up in Vancouver, Canada, and after beginning his acting career at age nine with a string of successful commercial and television parts, Ludwig landed the starring role of Will Stanton in 20th Century Fox’s action-adventure The Seeker: The Dark is Rising in 2007.Previously, Ludwig appeared in diverse films such as Lone Survivor directed by Peter Berg, Grown Ups 2 opposite Adam Sandler and Sony’s Film When The Game Stands Tall, opposite Laura Dern. In 2012, he appeared as Cato, the antagonist, in the box-office smash-hit The Hunger Games. Alexander also starred in Walt Disney Pictures’ hugely successful Race to Witch Mountain, opposite Dwayne Johnson and Carla Gugino.His talents extend beyond acting and filmmaking; Ludwig is a gifted musician and an avid outdoorsman. In his free time Ludwig can be found competing in extreme freestyle ski competitions on Whistler Mountain, or surfing the California coast.",
    "poster":
      "https://wallup.net/wp-content/uploads/2016/05/13/353549-men-Bj%C3%B6rn_Ironside-Alexander_Ludwig-blonde-actor-TV-Vikings_TV_series-axes-traditional_clothing.jpg",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_bjorn.jpg?w=548",
    "alt": "Alexander Ludwig as Bjorn , Vikings"
  },
  "emperor-charles": {
    "id": "emperor-charles",
    "title": "Emperor Charles",
    "subtitle": "Played by Lothaire Bluteau",
    "role": "secondary",
    "heroInfo":
      "Emperor Charles is a complex, troubled man, who has taken full credit for the defeat of the Vikings, although he hid in cowardice during the battle.",
    "actorName": "Lothaire Bluteau",
    "actorInfo":
      "Lothaire Bluteau is widely recognized for his role as Ambassador Marillac in the multiple Emmy-Award-winning series “The Tudors,” chronicling Henry VIII’s turbulent last days as king.Bluteau can also be seen starring alongside Ethan Hawke and Emma Watson in the upcoming feature film Regression, directed by Alejandro Amenabar. Recent credits include Gravy, a dark comedy about cannibalism in which Lothaire plays The Cook, and the award winning feature film Rouge Sang.Other notable recurring television roles include “Law & Order: Special Victims Unit,” “24” and “Oz.” In 1983, after a strong start in theatre where he performed in Canada, England, and the US, Bluteau made the jump to motion pictures. Since then, he has starred in many feature films including Jesus of Montreal, The Confessional (with Kristin Scott Thomas), Bent (alongside Clive Owen) and I Shot Andy Warhol with Lily Taylor. Bluteau performs in both French and English and his characters have ranged from a male prostitute (Being at Home with Claude) and a person with a developmental disability (Les Fous De Bassan) to a crooked jockey (Dead Heat) and a Jesuit missionary (Black Robe)",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_charles.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_charles.jpg?w=548",
    "alt": "Lothaire Bluteau as Emperor Charles , Vikings"
  },
  "floki": {
    "id": "floki",
    "title": "Floki",
    "subtitle": "Played by Gustaf Skarsgård",
    "role": "main",
    "heroInfo":
      "Floki is a genius ship builder and he designs and builds the prototype of the new generation of Viking ships which can sail across the open ocean but also up the shallowest of rivers. Without Floki, Ragnar would have never been able to fulfill his dreams of discovering new lands and new civilizations. Floki is a religious zealot who believes in the Gods above anything and everything, including Ragnar.",
    "actorName": "Gustaf Skarsgård",
    "actorInfo":
      "Gustaf Skarsgård is an internationally acclaimed film, television, and theater actor. Gustaf started acting as a six year old. He fell in love with the craft early on and kept working throughout his entire childhood. He was accepted at the Stockholm Academy of Dramatic Arts at the record early age of 18.After graduating in 2003, he became an ensemble member of the Royal Dramatic Theatre (Sweden’s National Theatre). Gustaf has starred in many European cinematic successes:  the academy award nominated Evil (nominated for a Guldbagge for Best Supporting Actor, Sweden’s highest cinema honor), Kidz in da Hood (winning a Guldbagge for Best Actor), and Patrik 1.5 (nominated for a Guldbagge for Best Actor). In 2007, he received the European Film Academy’s prestigious Shooting Star Award.  In 2010, he returned to the Theatre to star in “Hamlet” as the title role, to great critical acclaim.Gustaf’s most recent films include the independent psychological thriller VI, Peter Weir’s The Way Back (starring opposite Ed Harris and Colin Farrell), and the Golden Globe and Academy Award nominated adventure drama Kon-Tiki.",
    "poster": "https://theferkel.files.wordpress.com/2016/03/floki-vikings.jpg",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_floki.jpg?w=548",
    "alt": "Gustaf Skarsgård as Floki, Vikings"
  },
  "halfdan-the-black": {
    "id": "halfdan-the-black",
    "title": "Halfdan the Black",
    "subtitle": "Played by Jasper Pääkkönen",
    "role": "secondary",
    "heroInfo": "King Harald’s violent, devoutly loyal younger brother.",
    "actorName": "Jasper Pääkkönen",
    "actorInfo":
      "Jasper recently completed filming on Charles Belleville’s Jet Trash opposite Robert Sheehan. In 2013, he won a Jussi award in his native Finland for Best Actor in a Supporting Role for his appearance as Harri in Leijonasydän (Heart of a Lion).He also appeared as the character Kapu in Finland’s highest box office grossing film Lapland Odyssey in 2010, directed by Dome Karukoski. Lapland Odyssey won awards at the Jussi Awards and the Alpe d’Huez ICFF.Jasper comes from a family of actors and began acting in the Finnish National Theatre and the Helsinki City Theatre when he was a child. At the age of 20, following his studies at The Kallio Secondary School of Performing Arts, he became part of the original cast of a daily soap, which became a huge success.At the age of 20, he was selected to play the main role in Bad Boys, directed by the talented Aleksi Mäkelä, which became the biggest box-office hit ever in Finland. For his performance in this film, Jasper received the prize for “Best Actor” at the Brussels Film Festival in 2003. Roles in Vares and Addiction – When Nothing is Enough quickly followed. The film, Frozen Land, won many international awards including the Jury Prize in Moscow, the Nordic Award at the Gothenburg Festival and the Golden Owl at the Leeds Festival. Jasper’s creative collaboration with director Aleksi Mäkelä has proved fruitful–in 2005, he starred in Matti – Hell is for Heroes, and was cast in V2.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_halfdan.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_halfdan.jpg?w=548",
    "alt": "Jasper Pääkkönen as Halfdan the Black, Vikings"
  },
  "hvitserk": {
    "id": "hvitserk",
    "title": "Hvitserk",
    "subtitle": "Played by Marco Ilsø",
    "role": "main",
    "heroInfo":
      "Son of Ragnar. Hvitserk and his older brother Ubbe have a special bond because when they were children they jumped together in an icy lake and had to be rescued by Siggy, who died in the attempt. Hvitserk is more complex and a darker character than his brother Ubbe, characteristics which become more pronounced in time and lead to a terrible denouement.",
    "actorName": "Marco Ilsø",
    "actorInfo":
      "Marco Ilsø is a young self-taught actor, who has been working as an actor since childhood. Recently Marco starred in Mads Matthiesen’s “The Model” produced by Jonas Bagger for Zentropa Entertainments. In the fall of 2014 Marco starred in “The Absent One” directed by Mikkel Nørgaard, playing a young rich kid who studies at a boarding school and commits terrible crimes in his spare time.Marco debuted in DR’s Christmas series “Mikkel and The Gold Card” in 2008, when he was only 13 years old. Since then Marco has been working on various films including “Rebounce” (2011), “You and Me Forever” (2012) and “Danny’s Doomsday” (2014) by Martin Barnewitz.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_hvitserk.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_hvitserk.jpg?w=548",
    "alt": "Marco Ilsø as Hvitserk, Vikings"
  },
  "ivar-the-boneless": {
    "id": "ivar-the-boneless",
    "title": "Ivar the Boneless",
    "subtitle": "Played by Alex Høgh Andersen",
    "role": "main",
    "heroInfo":
      "Son of Ragnar. Perhaps the most famous Viking of all time, his pathological cruelty was notorious even during his own lifetime. Ivar is deeply ambitious and his ambitions will twist the legacy of his father out of shape, and create universal war. People are genuinely afraid of Ivar.",
    "actorName": "Alex Høgh Andersen",
    "actorInfo":
      "Born and raised in a small town southwest of Copenhagen, Alex Hogh Andersen discovered his love for acting while studying drama at a school for young children between the age of 7 and 19. It was there he learned the basics of acting including the discipline, focus, and teamwork it takes to succeed in the business. Andersen participated in many musical oriented plays and was fortunate to gain a lot of experience with many big roles. As his peers began auditioning for film roles, Anderson at age 17 realized the difference between acting roles in front of an audience versus in front of a camera. This translated into Andersen’s work and he began auditioning and continuing to study Film and Media Studies at the University of Copenhagen. Andersen appeared in numerous television and film projects in Denmark, and Vikings now marks his Hollywood debut.When he is not acting, Andersen enjoys spending much of his time focusing on photography. He considers himself a visual minded person; he continues to learn more and more about cameras due to his experience shooting and directing short films. Andersen also gives back when his has the chance to charities such as Unicef, Care Denmark, and Kræftensbekæmpelse (Fighting Cancer). He deeply relates to Fighting Cancer as his mother was diagnosed with breast cancer seven years ago.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_ivar.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_ivar.jpg?w=548",
    "alt": "Alex Høgh Andersen as Ivar the Boneless, Vikings"
  },
  "judith": {
    "id": "judith",
    "title": "Judith",
    "subtitle": "Played by Jennie Jacques",
    "role": "secondary",
    "heroInfo":
      "Judith is the daughter of King Aelle and wife to Aethelwulf. Her infatuation with Athelstan became her downfall, and their affair led to the birth of the child Alfred, who King Ecbert believes to be a child of God. Judith and her son survived through the protection of King Ecbert, but his protection comes with a price.",
    "actorName": "Jennie Jacques",
    "actorInfo":
      "Jacques began her acting career in 2009 on “The Bill” for Talkback Thames TV. This was quickly followed by the series regular role of Annie Miller in BBC’s “Desperate Romantics” and the guest lead role of Emily Mullins in “Larkrise to Candleford.” Jacques quickly built on this impressive start with leading roles in movies Cherry Tree Lane (Steel Mill Films), Shank (Revolver Films), Demons Never Die (Exile Media), Truth or Dare (Corona Pictures) and her award nominated role of Sophie in Ground Break Films’ The Other Side.Prior to her work as Judith, Jennie played the leading role of WPC Gina Dawson in series 1 & 2 of BBC Television’s “WPC 56,” as well as regular character Tash in “The Delivery Man” for ITV.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_judith.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_judith.jpg?w=548",
    "alt": "Jennie Jacques as Judith, Vikings"
  },
  "king-ecbert": {
    "id": "king-ecbert",
    "title": "King Ecbert",
    "subtitle": "Played by Linus Roache",
    "role": "secondary",
    "heroInfo":
      "King Ecbert is the ruler of Wessex, the largest of the five kingdoms in England with big plans to make it even larger. Ecbert is a sophisticated visionary, well versed in court life. Ecbert has always anticipated that he must someday face the Vikings and is prepared with strategies as to how they can be used to his advantage.",
    "actorName": "Linus Roache",
    "actorInfo":
      "Linus Roache first gained worldwide recognition in Antonia Bird’s critically acclaimed film, Priest.His numerous film credits include Wings of a Dove, Batman Begins, The Namesake & Blind Flight for which he received a Best Actor nomination from the Scottish BAFTA. He also played the lead role in Pandaemonium, which he won the Best Actor award at the Evening Standard Film Awards. He recently wrapped ID2: Shadwell Army in the UK.On the small screen Linus received a Golden Globe nomination for his portrayal of Robert Kennedy in the F/X television film, “RFK,” and also co-starred in HBO’s award-winning “The Gathering Storm,” which he won the Golden Satellite Award for best actor in a supporting role. Linus played series regular, Executive A.D.A. Michael Cutter, in NBC’s “Law & Order” and returned for the spin-off, “Law and Order: Special Victims Unit.” He also played a lead role in Julian Fellowes’ miniseries, “Titanic.”His extensive theatrical experience includes seasons with the RSC and “Richard II” and “Coriolanus,” opposite Ralph Fiennes at London’s Almeida Theatre and the Brooklyn Academy of Music.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_s3_ecbert.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_s3_ecbert.jpg?w=548",
    "alt": "Linus Roache as King Ecbert, Vikings"
  },
  "king-harald-finehair": {
    "id": "king-harald-finehair",
    "title": "King Harald Finehair",
    "subtitle": "Played by Peter Franzén",
    "role": "main",
    "heroInfo":
      "A complex character who seeks to be King of Norway and is a potential threat to Ragnar.",
    "actorName": "Peter Franzén",
    "actorInfo":
      "Franzén is one of Finland’s most accomplished actors. On the film side, Peter can most recently be seen as Reiniger in the spy thriller The Gunman opposite Sean Penn and Javier Bardem for Silver Pictures and Taken director Pierre Morel. Franzén made his feature directorial debut with his film Above Dark Waters which opened in his native Finland, based on a screenplay he wrote, adapted from his semi-autobiographical 2010 novel of the same name. The novel was originally adapted as a play at the Finnish National Theatre in 2012. Franzén is also promoting a follow-up novel to coming out soon, called With the Same Eyes.At the 2013 Toronto International Film Festival, Franzén was showcased in a the film Heart of a Lion from acclaimed Finnish director Dome Karukoski, where he played a Neo-Nazi skinhead who falls fast and hard for the female lead played by Laura Birn. The problem—she has a biracial young son. “Heart of a Lion” was hailed by critics as one of the most provocative films at the festival that year.Franzén’s career has spanned 20 years and over 40 movies, winning three Jussi Awards (Finland’s national film prize) with a total of seven nominations.Franzén also starred in the film Open Up To Me, which was nominated for a Nordic Council Film prize, and Antti Jokinen’s Purge which was Finland’s official selection to the Academy Awards.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_harald.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_harald.jpg?w=548",
    "alt": "Peter Franzén as King Harald Finehair, Vikings"
  },
  "princess-gisla": {
    "id": "princess-gisla",
    "title": "Princess Gisla",
    "subtitle": "Played by Morgane Polanski",
    "role": "secondary",
    "heroInfo":
      "The daughter of Emperor Charles and a beautiful, young woman of considerable courage and resolution. However, she is still a woman and therefore remains at the mercy of the powerful and calculating men around her. Much to her dismay, she is forced into an arranged marriage with Rollo, the new Duke of Normandy.",
    "actorName": "Morgane Polanski",
    "actorInfo":
      "Morgane Polanski is a French-born actress who has appeared in multiple films including The Pianist (2002), The Ghost Writer (2010) and Oliver Twist (2005).  She can also be seen in Graystone directed by Russell England, and the films Backstage and The Ninth Gate. Most recently she appeared in the 2015 horror-thriller Unhallowed Ground.Her theatre credits include “Spring Awakening,” “Midsummer Night’s Dream” and “Hedda Gabler.” Polanski recently graduated from the Central School of Speech & Drama at the University of London. She also attended the International School of Paris.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_gisla_.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_gisla_.jpg?w=548",
    "alt": "Morgane Polanski as Princess Gisla, Vikings"
  },
  "queen-aslaug": {
    "id": "queen-aslaug",
    "title": "Queen Aslaug",
    "subtitle": "Played by Alyssa Sutherland",
    "role": "secondary",
    "heroInfo":
      "Aslaug is the clever and beautiful daughter of the famed dragon slayer Sigurd and shield-maiden Brunhilde. Aslaug promised Ragnar that she would provide him with the sons which the ancient Seer prophesized for him–and she delivered.",
    "actorName": "Alyssa Sutherland",
    "actorInfo":
      "Alyssa first appeared in several independent films including The Fortune Theory, Don’t Look Up, and Day on Fire with Olympia Dukakis which screened at the Toronto and Berlin Film Festivals. On the small screen, Alyssa has appeared on NBC’s “Law & Order: Special Victims Unit” and FOX’s “New Amsterdam.” She will also soon be seen starring in the television adaptation of Stephen King’s bestselling novel, “The Mist.”A native of Brisbane, Australia, Alyssa began modeling at the age 15 and soon after appeared on her first of multiple Vogue Australia covers. Alyssa then moved to New York where she continued modeling and appeared in campaigns for Calvin Klein, Chanel, Ralph Lauren and Bulgari, among others.  She has been photographed by some of the world’s leading photographers including Herb Ritts, Steven Miesel, Bruce Weber and Ellen von Unwerth. In addition, Alyssa has appeared in dozens of international magazines including “Vogue,” “Elle,” “Marie Claire,” “Harper’s Bazaar” and “Glamour.”Alyssa currently resides in Los Angeles, California.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_aslaug_16_9.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_aslaug_16_9.jpg?w=548",
    "alt": "Alyssa Sutherland as Queen Aslaug, Vikings"
  },
  "rollo": {
    "id": "rollo",
    "title": "Rollo",
    "subtitle": "Played by Clive Standen",
    "role": "main",
    "heroInfo":
      "Rollo, Ragnar’s brother, is impulsive, wild, care-free and compulsive. Rollo is a fierce fighter who is often overshadowed by his brother. The relationship between Rollo and Ragnar is intense and always unpredictable. Rollo has become the Duke of Normandy after marrying Princess Gisla (the daughter of Emperor Charles) and is named defender of France from the Vikings.",
    "actorName": "Clive Standen",
    "actorInfo":
      "Actor Clive Standen has created a strong foothold in Hollywood, starring in several critically-acclaimed television series. He was just announced as the lead in NBC’s ambitious new mid-season series TAKEN, executive produced by Luc Besson, and based on the popular film franchise. Standen is best known for his portrayal of Sir Gawain in the Starz original series “Camelot” alongside Joseph Fiennes and Eva Green, and his starring role in the BBC America series “Robin Hood.” Prior to that he played Private Carl Harris in the award-winning sci-fi BBC series “Doctor Who” and starred in the drama Operation Barras, about the infamous SAS mission in Sierra Leon. On the silver screen, Standen starred in Vertigo Films’ Hammer of the Gods in the summer of 2013.In 2017, Clive will be seen in Screen Gems’ Patient Zero alongside Natalie Dormer, Matt Smith and Stanley Tucci, and was recently seen in Universal Picture’s Everest, starring opposite Kiera Knightley, Jake Gyllenhaal, Robin Wright and Josh Brolin.Trained as an actor at the National Youth Theatre, the National Youth Music Theatre and the London Academy of Music and Dramatic Art, Standen appeared in theatrical roles at the Royal Albert Hall and Shakespeare’s Globe Theatre, as well as in the critically-acclaimed revival of Tom Stoppard’s “The Invention of Love.”Born on a British Army base in Hollywood, County Down, Northern Ireland, Standen moved to England at the age of five. He discovered stunt-work and sword fighting, and by his teens was working as part of a professional stunt team, mastering skills such as horse riding, jousting and swordplay. A keen martial artist, he also studied Muay Thai boxing, and quickly became the undefeated national champion. He currently resides in London with his wife and three children.",
    "poster":
      "http://cimg.tvgcdn.net/i/r/2015/04/14/e5d22c96-499d-40b2-a2ba-fb0b8b70303f/thumbnail/1300x867/ebb341e7b931c9821a1206b97989030e/150414-news-vikings-standen.jpg",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_rollo.jpg?w=548",
    "alt": "Clive Standen as Rollo, Vikings"
  },
  "sigurd-snake-in-the-eye": {
    "id": "sigurd-snake-in-the-eye",
    "title": "Sigurd Snake in the Eye",
    "subtitle": "Played by David Lindström",
    "role": "secondary",
    "heroInfo":
      "Son of Ragnar. Sigurd was born with astigmatism in one eye, in the shape of a snake or dragon. This flaw has a damaging psychological impact on him, making him feel different from his older brothers and more estranged from the family. He is a sensitive young man, growing up feeling that he has to provide himself.",
    "actorName": "David Lindström",
    "actorInfo":
      "David Lindström, born January 2nd, 1995, in Borås, Sweden, started his career as a musician and played the piano before he began acting. After he finished his education from the stage school in Skara, Sweden, he played Simon Nilsson in the hit TV series “Blå Ögon” produced by Strix and the Swedish channel SVT.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_sigurd.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_sigurd.jpg?w=548",
    "alt": "David Lindström as Sigurd Snake in the Eye, Vikings"
  },
  "ubbe": {
    "id": "ubbe",
    "title": "Ubbe",
    "subtitle": "Played by Jordan Patrick Smith",
    "role": "main",
    "heroInfo":
      "The oldest son by Ragnar and Aslaug, he has a paternalistic attitude towards his younger brothers. Ubbe is a sensitive, thoughtful and attractive young man, in many ways the closest in outlook and instinct to his father Ragnar.",
    "actorName": "Jordan Patrick Smith",
    "actorInfo":
      "Jordan was a finalist for the 2015 Heath Ledger Scholarship which fosters the education and career development of emerging Australian actors within the United States. He has also worked with Angelina Jolie on Universal’s Unbroken, and recently finished shooting “Banished” for the BBC.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_ubbe.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/11/vikings_4b_cast_ubbe.jpg?w=548",
    "alt": "Jordan Patrick Smith as Ubbe, Vikings"
  },
  "the-seer": {
    "id": "the-seer",
    "title": "The Seer",
    "subtitle": "Played by John Kavanagh",
    "role": "secondary",
    "heroInfo":
      "The ancient seer is one of the most important figures in Viking life because the Vikings believe in fate and the Seers can read the runes and often translate the wishes of the gods",
    "actorName": "John Kavanagh",
    "actorInfo":
      "John Kavanagh’s most recent credits include the role of Arturo Toscanini in Florence Foster Jenkins directed by Stephen Frears. 2015 saw John play the role of Lysander in “A Midsummer Night’s Dream” directed by Gavin Quinn at The Abbey Theatre and the role of Grandad in Ciarán Dooley’s short film The Great Wide Open. Further recent screen credits include the role of Rev. William Benham in Ralph Fiennes’ The Invisible Woman, the role of Inspector Michaud in In Secret, directed by Charlie Stratton, and the role of Derry Quinn in The Stag directed by John Butler.John was a member of The Abbey Theatre Company for ten years before going freelance in 1977.  Since then he has played in a variety of roles, including “One Flew over the Cuckoo’s Nest,” “Taking Steps,” “Faith Healer,” “The Norman Conquest” and “Twelfth Night.” More recent Abbey credits include “A Life,” directed by Ben Barnes; “Da” by Hugh Leonard, directed by Patrick Mason; “Fool for Love” written by Sam Shepard and directed by Annie Ryan and “King Lear” directed by Selina Cartmell. John’s credits at the Gate Theatre include; “A Dublin Carol” and “See You Next Tuesday” both directed by Robin Lefevre; “The Homecoming” which transferred to London’s West End; “Eccentricities of a Nightingale” directed by Dominic Cook, “Dancing at Lughnasa” directed by Joe Dowling, “A View From the Bridge” directed by Mark Brokaw, “The Speckled People” directed by Toby Frow and “Present Laughter” directed by Alan Stanford, which went on to the Spoleto Festival in the US.His television work includes Jack Taylor: “Priest” (ZDF); “Titanic: Blood and Steel” (CBC); “Father & Son” (Left Bank Pictures); “The Clinic” (RTÉ); “The Tudors”” (BBC and Showtime); “Holby City”; “Inspector George Gently”; “Any Time Now”; “Rebel Heart”; “Vicious Circle”; “Shadow of a Gunman”; “Sharpe’s Sword”; “Screenplay”; “Love Lies Bleeding”; “Bad Company”; “Her Majesty’s Pleasure”; “Irish Stew”; “Lovejoy” and “Children of the North” (all for BBC). For Irish television, John has appeared in “The Riordans,” “Ballroom of Romance,” “Echoes” and “The Country Girls.”Film work includes Closing The Ring directed by Richard Attenborough; The Tiger’s Tail directed by John Boorman; The Black Dahlia directed by Brian de Palma; Alexander directed by Oliver Stone; The Halo Effect directed by Lance Daly; Mystics directed by David Blair; Candlelight directed by Aisling Walsh; Puckoon directed by Terence Ryan; A Love Divided directed by Sydney Macartney; Pete’s Meteor directed by Joe O’Byrne; The Butcher Boy directed by Neil Jordan; Some Mother’s Son directed by Terry George; Braveheart directed by Mel Gibson and Circle of Friends directed by Pat O’Connor.",
    "poster":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_seer.jpg?w=900",
    "previewPic":
      "http://cdn.watch.aetnd.com/prod.cdn.watch.aetnd.com.s3.amazonaws.com/sites/2/2016/10/vikings_season4_cast_seer.jpg?w=548",
    "alt": "John Kavanagh as The Seer, Vikings"
  }
}
